{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles, class and student management, and attendance tracking with role checks for teachers and parents.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend source files across routing, auth, UI, and dashboard pages.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables, color tokens, and dark mode settings.",
  "frontend/index.html": "Base HTML document loading the React app entry point.",
  "frontend/src/App.tsx": "Main router configuration mapping all app pages and role-protected routes, wrapped with AuthProvider and UI toaster.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header, nav links, user dropdown, and footer wrapping all routed pages.",
  "frontend/src/components/RoleRouteGuard.tsx": "Route guard enforcing authentication and role-based access, redirecting unauthorized users accordingly.",
  "frontend/src/contexts/AuthContext.tsx": "Provides auth state and actions using Internet Identity and localStorage, loading and storing user profiles. Manages login/logout logic and exposes authentication status via context.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, initializing access control and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity initialization, login, logout, and state management using AuthClient, exposing identity and login status via context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for profiles, classes, students, and attendance, with automatic cache invalidation.",
  "frontend/src/index.css": "Defines global Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/lib/polling.ts": "Exports a constant polling interval of 10 seconds.",
  "frontend/src/lib/validation.ts": "Provides simple validation functions for phone numbers and passwords.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Renders an access denied message with navigation buttons for home and login pages.",
  "frontend/src/pages/auth/ParentLoginPage.tsx": "Parent login form using Internet Identity and profile validation to authenticate and redirect to the parent dashboard.",
  "frontend/src/pages/auth/ParentSignUpPage.tsx": "Parent signup form that validates input, saves a new profile, logs the user in, and redirects to the parent dashboard.",
  "frontend/src/pages/auth/TeacherLoginPage.tsx": "Teacher login page handling Internet Identity auth, profile checks, and navigation to the teacher dashboard.",
  "frontend/src/pages/auth/TeacherSignUpPage.tsx": "Teacher signup form that validates user data, creates a teacher profile, logs in, and redirects to the teacher dashboard.",
  "frontend/src/pages/LandingPage.tsx": "Displays the app's marketing landing page with hero image, feature highlights, and teacher/parent signup and login links.",
  "frontend/src/pages/parent/ParentDashboardPage.tsx": "Dashboard for parents showing linked students and attendance metrics with student selection and history polling.",
  "frontend/src/pages/teacher/ClassDetailPage.tsx": "Displays class details, lists students, and provides a dialog form to add new students via API hooks.",
  "frontend/src/pages/teacher/TakeAttendancePage.tsx": "Loads class students, allows selecting a date, marking attendance, and submitting it using attendance API hooks.",
  "frontend/src/pages/teacher/TeacherDashboardPage.tsx": "Shows teacher classes, summary stats, and includes a dialog to create new classes through API hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL parameters with sessionStorage fallback and hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and core plugins for the frontend.",
  "project_state.json": "Project metadata describing ATTENDEASE features, requirements, architecture notes, and current implemented features."
}